cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'pokanop/pokanop'
tap 'rcmdnk/file'
tap 'shivammathur/php'
tap 'zero-sh/tap'

brew 'autoconf'
brew 'autojump'
brew 'bash-completion'
brew 'bzip2'
brew 'curl'
brew 'freetype'
brew 'gettext'
brew 'gmp'
brew 'goto'
brew 'htop'
brew 'libxml2'
brew 'libzip'
brew 'lz4'
brew 'mas'
brew 'nostromo'
brew 'openssl'
brew 'pcre2'
brew 'php@7.4'
brew 'pkg-config'
brew 'protobuf'
brew 'readline'
brew 'zstd'
brew 'wget'

brew 'bash'
brew 'coreutils'
brew 'findutils'
brew 'ffmpeg'
brew 'grc'
brew 'httpie'
brew 'irssi'
brew 'mackup'
brew 'nvm'
brew 'opencc'
brew 'pyenv'
brew 'ssh-copy-id'
brew 'terraform'
brew 'trash'
brew 'tree'
brew 'unrar'

cask 'hammerspoon'
cask 'beyond-compare'
cask 'dropbox'
cask 'google-chrome'
cask 'iterm2'
cask 'keka'
cask 'macdown'
cask 'neteasemusic'
cask 'ngrok'
cask 'recordit'
cask 'sketch'
cask 'sketch-toolbox'
cask 'sourcetree'
cask 'spectacle'
cask 'sublime-text3'
cask 'telegram'
cask 'utorrent'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'webkit-nightly'
cask 'wechat'
cask 'qq'
cask 'utools'
cask 'apipost'
cask 'evernote'
cask 'warp'
cask 'microsoft-edge'
cask 'wpsoffice'
cask 'clashx'
cask 'orbstack'
cask 'dingtalk'
cask 'feishu'
cask 'logi-options-plus'
cask 'jetbrains-toolbox'
cask 'docker-toolbox'
cask 'wechatwebdevtools'
cask 'zerotier-one'


cask 'font-hack'
cask 'font-noto-sans-japanese'
cask 'font-noto-sans-korean'
cask 'font-noto-sans-s-chinese'
cask 'font-noto-sans-t-chinese'
cask 'font-roboto'
cask 'font-source-code-pro'